sdk-php/tests/MercadoPago/Resources/Mocks/Response/PreApproval/preapproval_base.json

{
  "id": "2c9380847e9b451c017ea1bd70ba0219",
  "payer_id": 766790067,
  "payer_email": "",
  "back_url": "https://www.mercadopago.com.br",
  "collector_id": 823549964,
  "application_id": 6245132082630004,
  "status": "pending",
  "reason": "reason",
  "external_reference": "23546246234",
  "next_payment_date": "2022-01-10T10:10:10.000-00:00",
  "date_created": "2022-01-10T10:10:10.000-00:00",
  "last_modified": "2022-01-10T10:10:10.000-00:00",
  "init_point": "https://www.mercadopago.com.br/subscriptions/checkout?preapproval_id=2c9380847e9b451c017ea1bd70ba0219",
  "preapproval_plan_id": "2c9380848a630a69018a66713a68020c",
  "auto_recurring": {
    "frequency": 1,
    "frequency_type": "months",
    "transaction_amount": 10.00,
    "currency_id": "BRL",
    "start_date": "2022-01-10T10:10:10.000-00:00",
    "end_date": "2023-01-10T10:10:10.000-00:00",
    "billing_day_proportional": false,
    "has_billing_day": false,
    "free_trial": null
  },
  "summarized": {
    "quotas": 11,
    "charged_quantity": null,
    "pending_charge_quantity": 11,
    "charged_amount": null,
    "pending_charge_amount": 1357.95,
    "semaphore": null,
    "last_charged_date": null,
    "last_charged_amount": null
  },
  "payment_method_id": "master",
  "card_id": "9008789976",
  "first_invoice_offset": null
}
